artifacts/cfd-smoke/final-verification/cases/surge_1p5/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          320;
        startFace       37852;
    }
    outlet
    {
        type            patch;
        nFaces          320;
        startFace       38172;
    }
    sides
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          2304;
        startFace       38492;
    }
    hull
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          515;
        startFace       40796;
    }
)

// ************************************************************************* //
